prashant87/Self-Balancing-Robot-on-Tiva-C-TM4C-Dev-KIT/Firmware/Tiva C non OS/MPU/MPU6050.c
#include <stdint.h>
#include <stdbool.h>
#include <math.h>
#include <stdio.h>

#include "MPU6050.h"

#include "inc/tm4c123gh6pm.h"
#include "inc/hw_memmap.h"
#include "driverlib/gpio.h"
#include "driverlib/pin_map.h"
#include "driverlib/i2c.h"
#include "driverlib/sysctl.h"
#include "driverlib/timer.h"
#include "driverlib/interrupt.h"

// Comment out to restrict roll to ±90deg instead - please read: http://www.freescale.com/files/sensors/doc/app_note/AN3461.pdf
#define RESTRICT_PITCH

#define MPU6050_SMPLRT_DIV                  0x19
#define MPU6050_INT_PIN_CFG                 0x37
#define MPU6050_ACCEL_XOUT_H                0x3B
#define MPU6050_GYRO_XOUT_H                 0x43
#define MPU6050_PWR_MGMT_1                  0x6B
#define MPU6050_WHO_AM_I                    0x75

#define MPU6050_ADDRESS                     0x68
#define MPU6050_WHO_AM_I_ID                 0x68

// Scale factor for +-2000deg/s and +-8g - see datasheet:
#define MPU6050_GYRO_SCALE_FACTOR_2000      16.4f
#define MPU6050_ACC_SCALE_FACTOR_8          4096.0f

#define RAD_TO_DEG                          (180/3.14159)
#define dt_update                           (1.0/FREQ_UPDATE)

static uint32_t ui32Period;

static float f_Q_angle = 0.001f;
static float f_Q_bias = 0.003f;
static float f_R_measure = 0.03f;
static float f_angle = 0.0f; // Reset the angle
static float f_bias = 0.0f; // Reset bias
static float f_rate = 0.0f;
static float f_P[2][2];

static float f_angleX_;
static float f_angleY_;

double gyroXangle, gyroYangle; // Angle calculate using the gyro only
double compAngleX, compAngleY; // Calculated angle using a complementary filter
double kalAngleX, kalAngleY; // Calculated angle using a Kalman filter

static void I2C_MPU6050_Init(void);
static void I2C_Write(uint8_t addr, uint8_t regAddr, uint8_t data);
static void I2C_Write_Data(uint8_t addr, uint8_t regAddr, uint8_t *date, uint8_t length);
static uint8_t I2C_Read(uint8_t addr, uint8_t regAddr);
static void I2C_Read_Data(uint8_t addr, uint8_t regAddr, uint8_t *data, uint8_t length);

static void Timer_Init(void);
static void Timer_Interrupt_Handler(void);

static void MPU6050_First_Get_Data(void);

static void Kalman_Filter_Init(void);
static float Kalman_Get_Angle(float newAngle, float newRate, float dt);
//static void Kalman_Filter_Process(void);

// Ahrs copy source

#define sampleFreq      100.0f           // sample frequency in Hz
#define twoKpDef    (2.0f * 10.0f)  // 2 * proportional gain
#define twoKiDef    (2.0f * 0.1f)   // 2 * integral gain
static float roll, pitch, yaw;
static float gyro[3];
static float accel[3];
//static float mag[3];
static float q[4];

void mpu9250_get_accel(float accel[3]);
void mpu9250_get_gyro(float gyro[3]);

static float GYRO_BIAS_X = -4.42;
static float GYRO_BIAS_Y = 0.307;
static float GYRO_BIAS_Z = -1.494;
#define PI 3.14159265358979323846f

//---------------------------------------------------------------------------------------------------
// Variable definitions

static volatile float twoKp = twoKpDef;                                         // 2 * proportional gain (Kp)
static volatile float twoKi = twoKiDef;                                         // 2 * integral gain (Ki)
static volatile float q0 = 1.0f, q1 = 0.0f, q2 = 0.0f, q3 = 0.0f;                   // quaternion of sensor frame relative to auxiliary frame
static volatile float integralFBx = 0.0f,  integralFBy = 0.0f, integralFBz = 0.0f;  // integral error terms scaled by Ki
void MahonyAHRSupdateIMU(float gx, float gy, float gz, float ax, float ay, float az) ;
static float invSqrt(float x);
void ahrs_loop(void);
//
static void delay (uint32_t delay){
    SysCtlDelay(delay);
}

static void I2C_MPU6050_Init(void) {
    SysCtlPeripheralEnable(MPU6050_I2C); // Enable I2C1 peripheral
    delay(2); // Insert a few cycles after enabling the peripheral to allow the clock to be fully activated
    SysCtlPeripheralEnable(MPU6050_I2C_GPIO); // Enable GPIOA peripheral
    delay(2); // Insert a few cycles after enabling the peripheral to allow the clock to be fully activated

    // Use alternate function
    GPIOPinConfigure(MPU6050_I2C_SCL);
    GPIOPinConfigure(MPU6050_I2C_SDA);

    GPIOPinTypeI2CSCL(MPU6050_I2C_GPIO_BASE, MPU6050_GPIO_SCL); // Use pin with I2C SCL peripheral
    GPIOPinTypeI2C(MPU6050_I2C_GPIO_BASE, MPU6050_GPIO_SDA); // Use pin with I2C peripheral

    I2CMasterInitExpClk(MPU6050_I2C_BASE, SysCtlClockGet(), false); // Enable and set frequency to 400 kHz

    delay(2); // Insert a few cycles after enabling the I2C to allow the clock to be fully activated
}

static void I2C_Write(uint8_t addr, uint8_t regAddr, uint8_t data) {
    I2C_Write_Data(addr, regAddr, &data, 1);
}

static void I2C_Write_Data(uint8_t addr, uint8_t regAddr, uint8_t *data, uint8_t length) {
    I2CMasterSlaveAddrSet(MPU6050_I2C_BASE, addr, false); // Set to write mode

    I2CMasterDataPut(MPU6050_I2C_BASE, regAddr); // Place address into data register
    I2CMasterControl(MPU6050_I2C_BASE, I2C_MASTER_CMD_BURST_SEND_START); // Send start condition
    while (I2CMasterBusy(MPU6050_I2C_BASE)); // Wait until transfer is done

    uint8_t i = 0;
    for (i = 0; i < length - 1; i++) {
        I2CMasterDataPut(MPU6050_I2C_BASE, data[i]); // Place data into data register
        I2CMasterControl(MPU6050_I2C_BASE, I2C_MASTER_CMD_BURST_SEND_CONT); // Send continues condition
        while (I2CMasterBusy(MPU6050_I2C_BASE)); // Wait until transfer is done
    }

    I2CMasterDataPut(MPU6050_I2C_BASE, data[length - 1]); // Place data into data register
    I2CMasterControl(MPU6050_I2C_BASE, I2C_MASTER_CMD_BURST_SEND_FINISH); // Send finish condition
    while (I2CMasterBusy(MPU6050_I2C_BASE)); // Wait until transfer is done
}

static uint8_t I2C_Read(uint8_t addr, uint8_t regAddr) {
    I2CMasterSlaveAddrSet(MPU6050_I2C_BASE, addr, false); // Set to write mode

    I2CMasterDataPut(MPU6050_I2C_BASE, regAddr); // Place address into data register
    I2CMasterControl(MPU6050_I2C_BASE, I2C_MASTER_CMD_SINGLE_SEND); // Send data
    while (I2CMasterBusy(MPU6050_I2C_BASE)); // Wait until transfer is done

    I2CMasterSlaveAddrSet(MPU6050_I2C_BASE, addr, true); // Set to read mode

    I2CMasterControl(MPU6050_I2C_BASE, I2C_MASTER_CMD_SINGLE_RECEIVE); // Tell master to read data
    while (I2CMasterBusy(MPU6050_I2C_BASE)); // Wait until transfer is done
    return I2CMasterDataGet(MPU6050_I2C_BASE); // Read data
}

