prashant87/Self-Balancing-Robot-on-Tiva-C-TM4C-Dev-KIT/Firmware/Tiva C non OS/MPU/MPU6050.c
static void I2C_Read_Data(uint8_t addr, uint8_t regAddr, uint8_t *data, uint8_t length) {
    I2CMasterSlaveAddrSet(MPU6050_I2C_BASE, addr, false); // Set to write mode

    I2CMasterDataPut(MPU6050_I2C_BASE, regAddr); // Place address into data register
    I2CMasterControl(MPU6050_I2C_BASE, I2C_MASTER_CMD_SINGLE_SEND); // Send data
    while (I2CMasterBusy(MPU6050_I2C_BASE)); // Wait until transfer is done

    I2CMasterSlaveAddrSet(MPU6050_I2C_BASE, addr, true); // Set to read mode

    I2CMasterControl(MPU6050_I2C_BASE, I2C_MASTER_CMD_BURST_RECEIVE_START); // Send start condition
    while (I2CMasterBusy(MPU6050_I2C_BASE)); // Wait until transfer is done

    data[0] = I2CMasterDataGet(MPU6050_I2C_BASE); // Place data into data register
    uint8_t i = 1;
    for (i = 1; i < length - 1; i++) {
        I2CMasterControl(MPU6050_I2C_BASE, I2C_MASTER_CMD_BURST_RECEIVE_CONT); // Send continues condition
        while (I2CMasterBusy(MPU6050_I2C_BASE)); // Wait until transfer is done
        data[i] = I2CMasterDataGet(MPU6050_I2C_BASE); // Place data into data register
    }

    I2CMasterControl(MPU6050_I2C_BASE, I2C_MASTER_CMD_BURST_RECEIVE_FINISH); // Send finish condition
    while (I2CMasterBusy(MPU6050_I2C_BASE)); // Wait until transfer is done
    data[length - 1] = I2CMasterDataGet(MPU6050_I2C_BASE); // Place data into data register
}

static int8_t xx = 0;

static void Timer_Interrupt_Handler(void){
    // Clear the timer interrupt
    TimerIntClear(MPU6050_TIMER_BASE, MPU6050_TIMER_INT_FLAGS);
    Kalman_Filter_Process();
    ahrs_loop();
    if(xx == 0){
        xx = 1;
        GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_1, GPIO_PIN_1);
    }
    else{
        xx = 0;
        GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_1, 0);
    }
    delay(2);
}

static void Timer_Init(void){
    SysCtlPeripheralEnable(MPU6050_TIMER);
    TimerConfigure(MPU6050_TIMER_BASE, MPU6050_TIMER_CONFIG);

    ui32Period = SysCtlClockGet() / FREQ_UPDATE;
    TimerLoadSet(MPU6050_TIMER_BASE, MPU6050_TIMER_BASE_TIMER, ui32Period -1);

    TimerIntRegister(MPU6050_TIMER_BASE, MPU6050_TIMER_BASE_TIMER, &Timer_Interrupt_Handler);
    IntEnable(MPU6050_TIMER_INT);
    TimerIntEnable(MPU6050_TIMER_BASE, MPU6050_TIMER_INT_FLAGS);
    TimerIntClear(MPU6050_TIMER_BASE, MPU6050_TIMER_INT_FLAGS);
    TimerEnable(MPU6050_TIMER_BASE, MPU6050_TIMER_BASE_TIMER);
    TimerControlStall(MPU6050_TIMER_BASE, MPU6050_TIMER_BASE_TIMER, false);
    TimerEnable(MPU6050_TIMER_BASE, MPU6050_TIMER_BASE_TIMER);
    IntMasterEnable();
}

void MPU6050_Init(void) {
        SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF); //enable GPIO port for LED
        GPIOPinTypeGPIOOutput(GPIO_PORTF_BASE, GPIO_PIN_1); //enable pin for LED PF2
        SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
        GPIOPinTypeGPIOOutput(GPIO_PORTF_BASE, GPIO_PIN_3|GPIO_PIN_2);
        GPIOPinTypeGPIOOutput(GPIO_PORTF_BASE, GPIO_PIN_1); //enable pin for LED PF2
    I2C_MPU6050_Init();
    Timer_Init();
    Kalman_Filter_Init();

    uint8_t i2cBuffer[5]; // Buffer for I2C data
    i2cBuffer[0] = I2C_Read(MPU6050_ADDRESS, MPU6050_WHO_AM_I);
    I2C_Write(MPU6050_ADDRESS, MPU6050_PWR_MGMT_1, (1 << 7)); // Reset device, this resets all internal registers to their default values
    SysCtlDelay(SysCtlClockGet()/100);
    while (I2C_Read(MPU6050_ADDRESS, MPU6050_PWR_MGMT_1) & (1 << 7)) {
    // Wait for the bit to clear
    };
    SysCtlDelay(SysCtlClockGet()/100);
    I2C_Write(MPU6050_ADDRESS, MPU6050_PWR_MGMT_1, (1 << 3) | (1 << 0)); // Disable sleep mode, disable temperature sensor and use PLL as clock reference

    i2cBuffer[0] = 0; // Set the sample rate to 1kHz - 1kHz/(1+0) = 1kHz
    i2cBuffer[1] = 0x03; // Disable FSYNC and set 41 Hz Gyro filtering, 1 KHz sampling
    i2cBuffer[2] = 3 << 3; // Set Gyro Full Scale Range to +-2000deg/s
    i2cBuffer[3] = 2 << 3; // Set Accelerometer Full Scale Range to +-8g
    i2cBuffer[4] = 0x03; // 41 Hz Acc filtering
    I2C_Write_Data(MPU6050_ADDRESS, MPU6050_SMPLRT_DIV, i2cBuffer, 5); // Write to all five registers at once


    /* Enable Raw Data Ready Interrupt on INT pin */
    i2cBuffer[0] = (1 << 5) | (1 << 4); // Enable LATCH_INT_EN and INT_ANYRD_2CLEAR
    // When this bit is equal to 1, the INT pin is held high until the interrupt is cleared
    // When this bit is equal to 1, interrupt status is cleared if any read operation is performed
    i2cBuffer[1] = (1 << 0);            // Enable RAW_RDY_EN - When set to 1, Enable Raw Sensor Data Ready interrupt to propagate to interrupt pin
    I2C_Write_Data(MPU6050_ADDRESS, MPU6050_INT_PIN_CFG, i2cBuffer, 2); // Write to both registers at once

    delay(SysCtlClockGet()/3);

//    MPU6050_First_Get_Data();
    delay(SysCtlClockGet()/30);
}
void mpu9250_get_gyro(float gyro[3]){
    uint8_t raw[6];
//    unsigned long timestamp;
//    mpu_get_gyro_reg(raw, &timestamp);
    I2C_Read_Data(MPU6050_ADDRESS, MPU6050_GYRO_XOUT_H, raw, 6); // Note that we can't write directly into MPU6050_t, because of endian conflict. So it has to be done manually

    unsigned short fsr=2000;
//    mpu_get_gyro_fsr(&fsr);

//    gyro[0] = (float)raw[0]*(float)fsr/32768.0f;
//    gyro[1] = (float)raw[1]*(float)fsr/32768.0f;
//    gyro[2] = (float)raw[2]*(float)fsr/32768.0f;
     gyro[0] = (float)((raw[0] << 8) | raw[1]);
     gyro[1] = (float)((raw[2] << 8) | raw[3]);
     gyro[2] = (float)((raw[4] << 8) | raw[5]);
//     bufData[0] = (buf[0] << 8) | buf[1];    //Gyro X
//     bufData[1] = (buf[2] << 8) | buf[3];    //Gyro Y
//     bufData[2] = (buf[4] << 8) | buf[5];    //Gyro Z
}

void mpu9250_get_accel(float accel[3]){
    uint8_t raw[3];
//    unsigned long timestamp;
//    mpu_get_accel_reg(raw, &timestamp);
    I2C_Read_Data(MPU6050_ADDRESS, MPU6050_ACCEL_XOUT_H, raw, 6); // Note that we can't write directly into MPU6050_t, because of endian conflict. So it has to be done manually

//    unsigned char fsr;
//    mpu_get_accel_fsr(&fsr);
//     accel[0] = (float)raw[0]*(float)fsr/32768.0f;
    // accel[1] = (float)raw[1]*(float)fsr/32768.0f;
    // accel[2] = (float)raw[2]*(float)fsr/32768.0f;

    accel[0] = (float)((raw[0] << 8) | raw[1]);
    accel[1] = (float)((raw[2] << 8) | raw[3]);
    accel[2] = (float)((raw[4] << 8) | raw[5]);
}
void MPU6050_Get_Accel_Raw(int16_t * bufData) {
    uint8_t buf[6];
    I2C_Read_Data(MPU6050_ADDRESS, MPU6050_ACCEL_XOUT_H, buf, 6); // Note that we can't write directly into MPU6050_t, because of endian conflict. So it has to be done manually

    bufData[0] = (buf[0] << 8) | buf[1];    //Accel X
    bufData[1] = (buf[2] << 8) | buf[3];    //Accel Y
    bufData[2] = (buf[4] << 8) | buf[5];    //Accel Z
}

void MPU6050_Get_Gyro_Raw(int16_t * bufData) {
    uint8_t buf[6];
    I2C_Read_Data(MPU6050_ADDRESS, MPU6050_GYRO_XOUT_H, buf, 6); // Note that we can't write directly into MPU6050_t, because of endian conflict. So it has to be done manually

    bufData[0] = (buf[0] << 8) | buf[1];    //Gyro X
    bufData[1] = (buf[2] << 8) | buf[3];    //Gyro Y
    bufData[2] = (buf[4] << 8) | buf[5];    //Gyro Z
}

