prashant87/Self-Balancing-Robot-on-Tiva-C-TM4C-Dev-KIT/Firmware/Tiva C non OS/MPU/MPU6050.c
    // Calculate estimation error covariance - Update the error covariance
    /* Step 7 */
    float P00_temp = f_P[0][0];
    float P01_temp = f_P[0][1];

    f_P[0][0] -= K[0] * P00_temp;
    f_P[0][1] -= K[0] * P01_temp;
    f_P[1][0] -= K[1] * P00_temp;
    f_P[1][1] -= K[1] * P01_temp;

    return f_angle;
}

void Kalman_Set_Angle(float angle) {
    f_angle = angle;
}   // Used to set angle, this should be set as the starting angle

float Kalman_Get_Rate(void) {
    return f_rate;
}   // Return the unbiased rate

/* These are used to tune the Kalman filter */
void Kalman_Set_Qangle(float Q_angle) {
    f_Q_angle = Q_angle;
}

void Kalman_Set_Qbias(float Q_bias) {
    f_Q_bias = Q_bias;
}

void Kalman_Set_Rmeasure(float R_measure) {
    f_R_measure = R_measure;
}

float Kalman_Get_Qangle(void) {
    return f_Q_angle;
}

float Kalman_Get_Qbias(void) {
    return f_Q_bias;
}

float Kalman_Get_Rmeasure(void) {
    return f_R_measure;
}

void MahonyAHRSupdateIMU(float gx, float gy, float gz, float ax, float ay, float az) {
    float recipNorm;
    float halfvx, halfvy, halfvz;
    float halfex, halfey, halfez;
    float qa, qb, qc;

    // Compute feedback only if accelerometer measurement valid (avoids NaN in accelerometer normalisation)
    if(!((ax == 0.0f) && (ay == 0.0f) && (az == 0.0f))) {

        // Normalise accelerometer measurement
        recipNorm = invSqrt(ax * ax + ay * ay + az * az);
        ax *= recipNorm;
        ay *= recipNorm;
        az *= recipNorm;

        // Estimated direction of gravity and vector perpendicular to magnetic flux
        halfvx = q1 * q3 - q0 * q2;
        halfvy = q0 * q1 + q2 * q3;
        halfvz = q0 * q0 - 0.5f + q3 * q3;

        // Error is sum of cross product between estimated and measured direction of gravity
        halfex = (ay * halfvz - az * halfvy);
        halfey = (az * halfvx - ax * halfvz);
        halfez = (ax * halfvy - ay * halfvx);

        // Compute and apply integral feedback if enabled
        if(twoKi > 0.0f) {
            integralFBx += twoKi * halfex * (1.0f / sampleFreq);    // integral error scaled by Ki
            integralFBy += twoKi * halfey * (1.0f / sampleFreq);
            integralFBz += twoKi * halfez * (1.0f / sampleFreq);
            gx += integralFBx;  // apply integral feedback
            gy += integralFBy;
            gz += integralFBz;
        }
        else {
            integralFBx = 0.0f; // prevent integral windup
            integralFBy = 0.0f;
            integralFBz = 0.0f;
        }

        // Apply proportional feedback
        gx += twoKp * halfex;
        gy += twoKp * halfey;
        gz += twoKp * halfez;
    }

    // Integrate rate of change of quaternion
    gx *= (0.5f * (1.0f / sampleFreq));     // pre-multiply common factors
    gy *= (0.5f * (1.0f / sampleFreq));
    gz *= (0.5f * (1.0f / sampleFreq));
    qa = q0;
    qb = q1;
    qc = q2;
    q0 += (-qb * gx - qc * gy - q3 * gz);
    q1 += (qa * gx + qc * gz - q3 * gy);
    q2 += (qa * gy - qb * gz + q3 * gx);
    q3 += (qa * gz + qb * gy - qc * gx);

    // Normalise quaternion
    recipNorm = invSqrt(q0 * q0 + q1 * q1 + q2 * q2 + q3 * q3);
    q0 *= recipNorm;
    q1 *= recipNorm;
    q2 *= recipNorm;
    q3 *= recipNorm;
}

//---------------------------------------------------------------------------------------------------
// Fast inverse square-root
// See: http://en.wikipedia.org/wiki/Fast_inverse_square_root

static float invSqrt(float x) {
    float halfx = 0.5f * x;
    float y = x;
    long i = *(long*)&y;
    i = 0x5f3759df - (i>>1);
    y = *(float*)&i;
    y = y * (1.5f - (halfx * y * y));
    return y;
}

void ahrs_loop(void){
    mpu9250_get_gyro(accel);
    mpu9250_get_accel(gyro);
    gyro[0] -= GYRO_BIAS_X;
    gyro[1] -= GYRO_BIAS_Y;
    gyro[2] -= GYRO_BIAS_Z;

                    MahonyAHRSupdateIMU(gyro[0]*PI/180, gyro[1]*PI/180, gyro[2]*PI/180, accel[0], accel[1], accel[2]);
                           yaw   = atan2(2.0f * (q1 * q2 + q0 * q3), q0 * q0 + q1 * q1 - q2 * q2 - q3 * q3);
                           pitch = -asin(2.0f * (q1 * q3 - q0 * q2));
                           roll  = atan2(2.0f * (q0 * q1 + q2 * q3), q0 * q0 - q1 * q1 - q2 * q2 + q3 * q3);
                           pitch *= 180.0f / PI;
                           yaw   *= 180.0f / PI;
                           roll  *= 180.0f / PI;
}
float ahrs_get_roll(){
    return roll;
}

float ahrs_get_pitch(){
    return pitch;
}

float ahrs_get_yaw(){
    return yaw;
}
/* END OF FILE*/
